const mockData = [
  {
    time: '01:00',
    device: [
      {
        name: '001电压线',
        data: {
          'EP+': 10,
          'EP-': 20,
          'EQ+': 30,
          'EQ-': 40,
        },
      },
      {
        name: '002电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '003电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '004电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
    ],
  },
  {
    time: '02:00',
    device: [
      {
        name: '001电压线',
        data: {
          'EP+': 10,
          'EP-': 20,
          'EQ+': 30,
          'EQ-': 40,
        },
      },
      {
        name: '002电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '003电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '004电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
    ],
  },
  {
    time: '03:00',
    device: [
      {
        name: '001电压线',
        data: {
          'EP+': 10,
          'EP-': 20,
          'EQ+': 30,
          'EQ-': 40,
        },
      },
      {
        name: '002电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '003电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '004电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
    ],
  },
  {
    time: '04:00',
    device: [
      {
        name: '001电压线',
        data: {
          'EP+': 10,
          'EP-': 20,
          'EQ+': 30,
          'EQ-': 40,
        },
      },
      {
        name: '002电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '003电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '004电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
    ],
  },
  {
    time: '05:00',
    device: [
      {
        name: '001电压线',
        data: {
          'EP+': 10,
          'EP-': 20,
          'EQ+': 30,
          'EQ-': 40,
        },
      },
      {
        name: '002电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '003电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '004电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
    ],
  },
  {
    time: '06:00',
    device: [
      {
        name: '001电压线',
        data: {
          'EP+': 10,
          'EP-': 20,
          'EQ+': 30,
          'EQ-': 40,
        },
      },
      {
        name: '002电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '003电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '004电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
    ],
  },
  {
    time: '07:00',
    device: [
      {
        name: '001电压线',
        data: {
          'EP+': 10,
          'EP-': 20,
          'EQ+': 30,
          'EQ-': 40,
        },
      },
      {
        name: '002电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '003电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '004电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
    ],
  },
  {
    time: '08:00',
    device: [
      {
        name: '001电压线',
        data: {
          'EP+': 10,
          'EP-': 20,
          'EQ+': 30,
          'EQ-': 40,
        },
      },
      {
        name: '002电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '003电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '004电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
    ],
  },
  {
    time: '09:00',
    device: [
      {
        name: '001电压线',
        data: {
          'EP+': 10,
          'EP-': 20,
          'EQ+': 30,
          'EQ-': 40,
        },
      },
      {
        name: '002电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '003电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '004电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
    ],
  },
  {
    time: '10:00',
    device: [
      {
        name: '001电压线',
        data: {
          'EP+': 10,
          'EP-': 20,
          'EQ+': 30,
          'EQ-': 40,
        },
      },
      {
        name: '002电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '003电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '004电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
    ],
  },
  {
    time: '11:00',
    device: [
      {
        name: '001电压线',
        data: {
          'EP+': 10,
          'EP-': 20,
          'EQ+': 30,
          'EQ-': 40,
        },
      },
      {
        name: '002电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '003电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '004电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
    ],
  },
  {
    time: '12:00',
    device: [
      {
        name: '001电压线',
        data: {
          'EP+': 10,
          'EP-': 20,
          'EQ+': 30,
          'EQ-': 40,
        },
      },
      {
        name: '002电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '003电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '004电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
    ],
  },
  {
    time: '13:00',
    device: [
      {
        name: '001电压线',
        data: {
          'EP+': 10,
          'EP-': 20,
          'EQ+': 30,
          'EQ-': 40,
        },
      },
      {
        name: '002电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '003电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '004电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
    ],
  },
  {
    time: '14:00',
    device: [
      {
        name: '001电压线',
        data: {
          'EP+': 10,
          'EP-': 20,
          'EQ+': 30,
          'EQ-': 40,
        },
      },
      {
        name: '002电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '003电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '004电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
    ],
  },
  {
    time: '15:00',
    device: [
      {
        name: '001电压线',
        data: {
          'EP+': 10,
          'EP-': 20,
          'EQ+': 30,
          'EQ-': 40,
        },
      },
      {
        name: '002电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '003电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '004电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
    ],
  },
  {
    time: '16:00',
    device: [
      {
        name: '001电压线',
        data: {
          'EP+': 10,
          'EP-': 20,
          'EQ+': 30,
          'EQ-': 40,
        },
      },
      {
        name: '002电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '003电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '004电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
    ],
  },
  {
    time: '17:00',
    device: [
      {
        name: '001电压线',
        data: {
          'EP+': 10,
          'EP-': 20,
          'EQ+': 30,
          'EQ-': 40,
        },
      },
      {
        name: '002电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '003电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '004电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
    ],
  },
  {
    time: '18:00',
    device: [
      {
        name: '001电压线',
        data: {
          'EP+': 10,
          'EP-': 20,
          'EQ+': 30,
          'EQ-': 40,
        },
      },
      {
        name: '002电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '003电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '004电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
    ],
  },
  {
    time: '19:00',
    device: [
      {
        name: '001电压线',
        data: {
          'EP+': 10,
          'EP-': 20,
          'EQ+': 30,
          'EQ-': 40,
        },
      },
      {
        name: '002电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '003电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '004电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
    ],
  },
  {
    time: '20:00',
    device: [
      {
        name: '001电压线',
        data: {
          'EP+': 10,
          'EP-': 20,
          'EQ+': 30,
          'EQ-': 40,
        },
      },
      {
        name: '002电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '003电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '004电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
    ],
  },
  {
    time: '21:00',
    device: [
      {
        name: '001电压线',
        data: {
          'EP+': 10,
          'EP-': 20,
          'EQ+': 30,
          'EQ-': 40,
        },
      },
      {
        name: '002电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '003电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '004电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
    ],
  },
  {
    time: '22:00',
    device: [
      {
        name: '001电压线',
        data: {
          'EP+': 10,
          'EP-': 20,
          'EQ+': 30,
          'EQ-': 40,
        },
      },
      {
        name: '002电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '003电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '004电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
    ],
  },
  {
    time: '23:00',
    device: [
      {
        name: '001电压线',
        data: {
          'EP+': 10,
          'EP-': 20,
          'EQ+': 30,
          'EQ-': 40,
        },
      },
      {
        name: '002电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '003电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '004电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
    ],
  },
  {
    time: '24:00',
    device: [
      {
        name: '001电压线',
        data: {
          'EP+': 10,
          'EP-': 20,
          'EQ+': 30,
          'EQ-': 40,
        },
      },
      {
        name: '002电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '003电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
      {
        name: '004电压线',
        data: { 'EP+': 10, 'EP-': 20, 'EQ+': 30, 'EQ-': 40 },
      },
    ],
  },
];

export default mockData;
